tests/Mock/CompletePurchaseSuccess.txt

HTTP/1.1 200 OK
Date: Thu, 24 Sep 2015 13:15:25 GMT
Server: webservices gateway 4 mod_fcgid/2.3.6
Content-Length: 1656
Vary: Accept-Encoding
Content-Type: text/xml

<?xml version='1.0' encoding='utf-8'?>
<responseblock version="3.67">
  <requestreference>W4-9365p1nq</requestreference>
  <response type="AUTH">
    <merchant>
      <merchantname>DummyMercha</merchantname>
      <orderreference>test-1234</orderreference>
      <tid>27882788</tid>
      <merchantnumber>00000000</merchantnumber>
      <merchantcountryiso2a>GB</merchantcountryiso2a>
    </merchant>
    <transactionreference>4-9-2324407</transactionreference>
    <timestamp>2015-09-24 13:15:25</timestamp>
    <acquirerresponsecode>00</acquirerresponsecode>
    <operation>
      <splitfinalnumber>1</splitfinalnumber>
      <parenttransactionreference>5-9-2087427</parenttransactionreference>
      <accounttypedescription>ECOM</accounttypedescription>
    </operation>
    <settlement>
      <settleduedate>2015-09-24</settleduedate>
      <settlestatus>0</settlestatus>
    </settlement>
    <billing>
      <amount currencycode="GBP">110</amount>
      <payment type="VISA">
        <issuer>SecureTrading Test Issuer1</issuer>
        <pan>411111######1111</pan>
        <issuercountry>US</issuercountry>
      </payment>
      <dcc enabled="0"/>
    </billing>
    <authcode>TEST74</authcode>
    <threedsecure>
      <cavv>Q0FWVkNBVlZDQVZWQ0FWVkNBVlY=</cavv>
      <status>Y</status>
      <xid>dHFncHQ1WUltcGhKS1NCUmFGUUo=</xid>
      <eci>05</eci>
      <enrolled>Y</enrolled>
    </threedsecure>
    <live>0</live>
    <error>
      <message>Ok</message>
      <code>0</code>
    </error>
    <security>
      <postcode>0</postcode>
      <securitycode>2</securitycode>
      <address>0</address>
    </security>
  </response>
</responseblock>
