tests/Mock/PurchaseCardReferenceSuccess.txt

HTTP/1.1 200 OK
Date: Thu, 24 Sep 2015 06:53:54 GMT
Server: webservices gateway 3 mod_fcgid/2.3.6
Content-Length: 1448
Vary: Accept-Encoding
Content-Type: text/xml

<?xml version='1.0' encoding='utf-8'?>
<responseblock version="3.67">
  <requestreference>W3-aa3e8wp6</requestreference>
  <response type="AUTH">
    <merchant>
      <merchantname>DummyMercha</merchantname>
      <orderreference>test-1234</orderreference>
      <tid>27882788</tid>
      <merchantnumber>00000000</merchantnumber>
      <merchantcountryiso2a>GB</merchantcountryiso2a>
    </merchant>
    <transactionreference>3-9-2205017</transactionreference>
    <timestamp>2015-09-24 06:53:54</timestamp>
    <acquirerresponsecode>00</acquirerresponsecode>
    <operation>
      <splitfinalnumber>1</splitfinalnumber>
      <parenttransactionreference>6-9-1918130</parenttransactionreference>
      <accounttypedescription>ECOM</accounttypedescription>
    </operation>
    <settlement>
      <settleduedate>2015-09-24</settleduedate>
      <settlestatus>0</settlestatus>
    </settlement>
    <billing>
      <amount currencycode="GBP">98</amount>
      <payment type="VISA">
        <issuer>SecureTrading Test Issuer1</issuer>
        <pan>411111######1111</pan>
        <issuercountry>US</issuercountry>
      </payment>
      <dcc enabled="0"/>
    </billing>
    <authcode>TEST05</authcode>
    <live>0</live>
    <error>
      <message>Ok</message>
      <code>0</code>
    </error>
    <security>
      <postcode>0</postcode>
      <securitycode>0</securitycode>
      <address>0</address>
    </security>
  </response>
</responseblock>
